slipperstree/MyMcu51Prog/STC12C5A60S2/01_16x64LED/16x64LED_For89C52.c
/*************************************************************************************
【功能】
    驱动16x64 LED点阵屏滚动显示任意指定汉字。
    由于汉字字库体积巨大（16x16的标准汉字点阵字库需要260KB），单片机的ROM存放不下整个字库。
    想显示任意汉字就必须借助外部储存芯片，本程序采用的是专门的点阵字库芯片。（其实也可使用Flash芯片）

【芯片选型】
    单片机
        STC89C52 （或符合下列条件的单片机均可）
            ROM(Flash)  : 8K字节 (或以上）
            RAM(xdata)  : 256字节 (或以上）
            IO          : 12个 (或以上，见端口定义说明)

    外部字库芯片
        GT20L16S1Y （高通的16x16字库芯片）
        <关于供电电压>
          该芯片需要3.3v供电
          可以使用1117等LDO将5V电源转成3.3v(作者采用的方法)
          5v直接供电作者没有试过，可能也可以
          IO电平方面，虽然电压不同但实测可以和5v单片机直连，没有问题
        <不想/不会使用外部字库芯片>
          GT20L16S1Y芯片是SOT23封装的比较小，个人爱好者使用起来不是很方便，特别是对于初学者不太友好。
          如果不用外部芯片也可以使用固定的点阵字模，这种情况下请放开程序里ziku_table数组定义的注释，
          字模放在这个数组里，同时修改程序里的 bufHZ 为 ziku_table即可。相关的引脚悬空。(相关程序也要做调整，加油)

【晶振】
    使用12M以上的晶体。建议使用24M以上的晶体，晶振频率越高，显示字不会出现闪烁感。
    如果使用24M以下的晶体，如果是STC的芯片，建议打开6T(双倍速)功能。

【端口定义】
    点阵屏模块
        LATCH  - P1.0  (串行数据锁存)
        CLK    - P1.1  (串行数据时钟)
        R1     - P1.2  (串行数据输入，R1表示上屏红灯数据信号，R2下红，G1上绿，G2下绿，作者的模块是单红色板且只有32单行的上屏，所以接R1即可)
        EN     - P1.3
        A      - P1.4
        B      - P1.5
        C      - P1.6
        D      - P1.7
    字库芯片 GT20L16S1Y
        CE     - P2^0
        SCLK   - P2^1
        SI     - P2^2
        SO     - P2^3
*/

/*头文件*/
#include <intrins.h>
#include <STC89C52.h>
#define uint unsigned int
#define uchar unsigned char
#define NOP() _nop_()

#define FOSC 32000000L      // 系统晶振频率
#define SCROLL_SPEED 20    // 文字滚动速度（5-500）越小越快

// 点阵屏定义 #########################################################################################
sbit EN_port 	= P1^3;
sbit DA_in_port = P1^2;
sbit CLK_port 	= P1^1;
sbit Latch_port = P1^0;

#define ABCD_port P1  //HC138 ABCD端口定义
//sbit D_port = P1^7;
//sbit C_port = P1^6;
//sbit B_port = P1^5;
//sbit A_port = P1^4;

// 大Buffer
// 保存16X64点阵信息（128字节）（4个汉字）
// ——————————————————————————————————————————————————————————
// B0	B16		B32		B48		B64		B80		B96		B112
// ——————————————————————————————————————————————————————————
// B1	B17		.		.		.       .       .       .
// ——————————————————————————————————————————————————————————
// B2	B18		.		.		.       .       .       .
// ——————————————————————————————————————————————————————————
// .	.		.       .       .       .       .       .
// .	.		.       .       .       .       .       .
// .	.		.       .       .       .       .       .
// ——————————————————————————————————————————————————————————
// B15	B31		B47		B63		B79		B95		B111	B127
// ——————————————————————————————————————————————————————————
uchar xdata bufHZ[128] = {
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};

uchar nowShiftOffset=0; 	// 当前左移偏移量(0-15)
int nowShowTextPos=0;		// 当前显示第几个汉字（严格来说是第几个字节）

// 一次性传给HC595用的64+16位的一整行数据（包括移位用的第五个汉字的缓冲区）
uchar data row_data_buf[10];
void HC595_Data_Send(uchar *p, uchar han, uchar offset);

// 画面刷新到一半时不允许左移
bit isShowing = 0;

// 左移函数 （包括从IC取最右边的一列数据，存入大buffer，同时更新当前偏移位置）
void shiftLeft(void);

// 显示文字设置，注意长度和文字内容要匹配
//int showDataSize=8*2;
//uchar code textForShow[] = "测试一下子好不好";
int showDataSize=972*2;
uchar code textForShow[] = "《长恨歌》【唐·白居易】汉皇重色思倾国，御宇多年求不得。杨家有女初长成，养在深闺人未识。天生丽质难自弃，一朝选在君王侧。回眸一笑百媚生，六宫粉黛无颜色。春寒赐浴华清池，温泉水滑洗凝脂。侍儿扶起娇无力，始是新承恩泽时。云鬓花颜金步摇，芙蓉帐暖度春宵。春宵苦短日高起，从此君王不早朝。承欢侍宴无闲暇，春从春游夜专夜。后宫佳丽三千人，三千宠爱在一身。金屋妆成娇侍夜，玉楼宴罢醉和春。姊妹弟兄皆列土，可怜光彩生门户。遂令天下父母心，不重生男重生女。骊宫高处入青云，仙乐风飘处处闻。缓歌慢舞凝丝竹，尽日君王看不足。渔阳鼙鼓动地来，惊破霓裳羽衣曲。九重城阙烟尘生，千乘万骑西南行。翠华摇摇行复止，西出都门百余里。六军不发无奈何，宛转蛾眉马前死。花钿委地无人收，翠翘金雀玉搔头。君王掩面救不得，回看血泪相和流。黄埃散漫风萧索，云栈萦纡登剑阁。峨嵋山下少人行，旌旗无光日色薄。蜀江水碧蜀山青，圣主朝朝暮暮情。行宫见月伤心色，夜雨闻铃肠断声。天旋日转回龙驭，到此踌躇不能去。马嵬坡下泥土中，不见玉颜空死处。君臣相顾尽沾衣，东望都门信马归。归来池苑皆依旧，太液芙蓉未央柳。芙蓉如面柳如眉，对此如何不泪垂。春风桃李花开夜，秋雨梧桐叶落时。西宫南内多秋草，落叶满阶红不扫。梨园弟子白发新，椒房阿监青娥老。夕殿萤飞思悄然，孤灯挑尽未成眠。迟迟钟鼓初长夜，耿耿星河欲曙天。鸳鸯瓦冷霜华重，翡翠衾寒谁与共。悠悠生死别经年，魂魄不曾来入梦。临邛道士鸿都客，能以精诚致魂魄。为感君王展转思，遂教方士殷勤觅。排空驭气奔如电，升天入地求之遍。上穷碧落下黄泉，两处茫茫皆不见。忽闻海上有仙山，山在虚无缥渺间。楼阁玲珑五云起，其中绰约多仙子。中有一人字太真，雪肤花貌参差是。金阙西厢叩玉扃，转教小玉报双成。闻到汉家天子使，九华帐里梦魂惊。揽衣推枕起徘回，珠箔银屏逦迤开。云鬓半偏新睡觉，花冠不整下堂来。风吹仙袂飘摇举，犹似霓裳羽衣舞。玉容寂寞泪阑干，梨花一枝春带雨。含情凝睇谢君王，一别音容两渺茫。昭阳殿里恩爱绝，蓬莱宫中日月长。回头下望人寰处，不见长安见尘雾。唯将旧物表深情，钿合金钗寄将去。钗留一股合一扇，钗擘黄金合分钿。但教心似金钿坚，天上人间会相见。临别殷勤重寄词，词中有誓两心知。七月七日长生殿，夜半无人私语时。在天愿作比翼鸟，在地愿为连理枝。天长地久有时尽，此恨绵绵无绝期。";
//int showDataSize=297*2;
//uchar code textForShow[] = "我们好像在哪儿见过你记得吗？好像那是一个春天我刚发芽，我走过，没有回头，我记得，我快忘了。我们好像在哪儿见过你记得吗？记得那是一个夏天盛开如花，我唱歌，没有对我，但我记得，可我快忘了。我们好像在哪见过你记得吗？好像那是一个秋天夕阳西下，你美得让我不敢和你说话，你经过我时风起浮动我的发。我们好像在哪见过你记得吗？记得那是一个冬天漫天雪花，我走过，没有回头，我记得，我快忘了。我们好像在哪见过你记得吗？那时你还是个孩子我在窗棂下，我猜着你的名字刻在了墙上，我画了你的摸样对着弯月亮我们好像在哪见过你记得吗？当我们来到今生各自天涯，天涯相望今生面对谁曾想，还能相遇一切就像梦一样。我们好像在哪见过。";

// 不使用字库芯片而使用固定文字时放开这一段，并修改程序里的 bufHZ 为 ziku_table
// 取模软件，需要指定【阴码+顺向（高位在前）+行列式】的形式
// uchar code ziku_table[]={
// 0x00,0x30,0xC0,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x60,0x10,/*"[",0*/
// 0x00,0x78,0x48,0x57,0x50,0x61,0x51,0x4A,0x4B,0x48,0x69,0x51,0x42,0x44,0x40,0x40,
// 0x40,0x40,0x40,0xFE,0x80,0x20,0x20,0x20,0xFC,0x20,0x28,0x24,0x22,0x22,0xA0,0x40,/*"陈",1*/
// 0x00,0xFF,0x01,0x01,0x01,0x7F,0x41,0x41,0x49,0x45,0x41,0x49,0x45,0x41,0x41,0x40,
// 0x00,0xFE,0x00,0x00,0x00,0xFC,0x04,0x04,0x44,0x24,0x04,0x44,0x24,0x04,0x14,0x08,/*"雨",2*/
// 0x00,0xFF,0x02,0x7A,0x4A,0x7A,0x00,0xFF,0x02,0x7A,0x4A,0x4A,0x7A,0x02,0x0A,0x04,
// 0x20,0x20,0x20,0x7E,0x42,0x84,0x10,0x10,0x10,0x10,0x28,0x28,0x28,0x44,0x44,0x82,/*"歌",3*/
// 0x00,0xC0,0x30,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x20,0xC0,/*"]",4*/
// };

// 测试用的字母A的16x8点阵
// 可直接这样显示在画面上 -> setICDataToBuffer(ic_data_A, 16, 0);
uchar code ic_data_A[] = {0x00,0xE0,0x9C,0x82,0x9C,0xE0,0x00,0x00,0x0F,0x00,0x00,0x00,0x00,0x00,0x0F,0x00};

