slipperstree/MyMcu51Prog/STC12C5A60S2/01_16x64LED/16x64LED_For89C52.c
// 字库芯片定义 ###################################################################################
sbit pCE        =P2^0;         // 片选
sbit pSCLK      =P2^1;         // 时钟
sbit pSI        =P2^2;         // 数据输入（单片机->字库芯片）
sbit pSO        =P2^3;         // 数据输出（字库芯片->单片机）

unsigned long addr;
int idx = 0;
uchar data ic_data[32];

// 从芯片取当前文字当前偏移量下的完整点阵
void readICDataToBuffer(uchar* str);
// 从芯片取点阵的子函数
uchar* getICData_ASCII_8x16(uchar ch);
uchar* getICData_Hanzi_16x16(uchar* hz);
void getICData_Hanzi_16x16_Col(uchar* hz, uchar colIdx, uchar* colData);

// 芯片取到的数据转换成适合模块的数据格式并保存在大buffer中
void setICDataToBuffer(uchar *pICData, uchar size, uchar pos);

// 串口定义 ######################################################################################
typedef unsigned char BYTE;
typedef unsigned int WORD;

//#define FOSC 11059200L      //System frequency
#define BAUD 600           //UART baudrate
//#define BAUD 115200           //UART baudrate

/*Define UART parity mode*/
#define NONE_PARITY     0   //None parity
#define ODD_PARITY      1   //Odd parity
#define EVEN_PARITY     2   //Even parity
#define MARK_PARITY     3   //Mark parity
#define SPACE_PARITY    4   //Space parity

#define PARITYBIT NONE_PARITY   //Testing even parity

void SendData(BYTE dat);
void SendString(char *s);
void UartInit();

bit busy;

uchar serialRcvBuf[10]={0,0,0,0,0,0,0,0,0,0};
uchar serialRcvIdx=0;

// 其他定义 ######################################################################################
//test
void testSetFullScreenByte(uchar);
//test



int ttTimer0 = 0;
void Timer0Init(void)		//30us@32.000MHz@6T
{
	EA=0;

	TMOD &= 0xF0;	//设置定时器模式
	TMOD |= 0x02;	//设置定时器模式（8位自动重载）
	TL0 = 0xb0;		//设置定时初值(30us@6T@@32.000MHz)
	TH0 = 0xb0;		//设置定时初值(30us@6T@32.000MHz)
	TF0 = 0;		//清除TF0标志
	TR0 = 1;		//定时器0开始计时
    ET0 = 1;

	EA=1;
}

int ttTimer2 = 0;
#define T1MS (65536-FOSC/6/1000)    //FOSC/6的这个6表示下载时指定了6T模式，如果是默认12T则改成12
void Timer2Init(void)
{
	RCAP2L = TL2 = T1MS;            //initial timer2 low byte
    RCAP2H = TH2 = T1MS >> 8;       //initial timer2 high byte
    TR2 = 1;                        //timer2 start running
    ET2 = 1;                        //enable timer2 interrupt
    EA = 1;                         //open global interrupt switch
}

uchar rowIdx=0; // 第几行
void display(){
	uchar i;
	
	// 循环从大buffer中取当前行从左到右的全部8个字节作为一整行数据保存在显示用的buff中
	for (i=0;i<10;i++){
		row_data_buf[i]=bufHZ[i*16 + rowIdx];
	}
	
	// 将上面取到的一整行数据串行输出给74HC595阵列，点亮当前行的数据
	HC595_Data_Send(row_data_buf,rowIdx,nowShiftOffset);
			
	// 当前行数加1，继续下一行的扫描
	rowIdx++;
	
	// 扫描完16行，回到第一行继续行扫描
	if(rowIdx==16) rowIdx=0;
}

void main()
{
	// 每次从最右端（nowShowTextPos+8的汉字）开始左移进来
	nowShowTextPos = -8;

//	UartInit(); //使用Timer1作为波特率发生器
	Timer0Init();
//  Timer2Init(); //事实证明，不用2个定时器就可以处理好，关键是精准控制行扫描和左移时间
	
	// For test --------------------------------------------------------------------------------
	//readICDataToBuffer( getICData_Hanzi_16x16("全"), 32, 0);
//	readICDataToBuffer(textForShow);
	//readICDataToBuffer("汉汉皇皇");
	
	//setICDataToBuffer(getICData_ASCII_8x16('A'), 16, 0);
	//setICDataToBuffer(ic_data_A, 16, 0);
	// For test --------------------------------------------------------------------------------

	// while (1){
	// 	display();
	//  //串口接收到文本显示在画面上 还需要修改	
	// 	if(serialRcvIdx >= 8){
	// 		readICDataToBuffer(serialRcvBuf);
	// 		serialRcvIdx=0;
	// 	}
	// }

    while(1){
		//display();
		//testSetFullScreenByte(0xff);
	}
}

// 将接收到的IC点阵数据存入缓冲区用于显示
// pICData	- 接收到的点阵数组
// size		- 点阵数组的大小。通常汉字为32字节，半角ASCII码为16字节。
// pos		- 指定该点阵数据显示的开始位置(0-7)，以8位（列）为一个单位。会覆盖原来的数据。
void setICDataToBuffer(uchar *pICData, uchar size, uchar pos)
{
	// ############# 从字库芯片GT20L16S1Y取出的点阵信息是竖置横列模式（例：字母A） ############# 
	// 从字库芯片GT20L16S1Y取出的点阵信息是竖置横列模式，也就是以竖排为单位取到的数据
	// ---- 下面从芯片取到的字母A的点阵数据 竖置横排的（而且是高位在下面，低位在上面） ---- 
	//       B0	B1	B2	B3	B4	B5	B6	B7
	// bit0  0	0	0	0	0	0	0	0
	// bit1  0	0	0	●	0	0	0	0
	// bit2  0	0	●	0	●	0	0	0
	// bit3  0	0	●	0	●	0	0	0
	// bit4  0	0	●	0	●	0	0	0
	// bit5  0	●	0	0	0	●	0	0
	// bit6  0	●	0	0	0	●	0	0
	// bit7  0	●	●	●	●	●	0	0
	//       B8	B9	B10	B11	B12	B13	B14	B15
	// bit0  ●	0	0	0	0	0	●	0
	// bit1  ●	0	0	0	0	0	●	0
	// bit2  ●	0	0	0	0	0	●	0
	// bit3  ●	0	0	0	0	0	●	0
	// bit4  0	0	0	0	0	0	0	0
	// bit5  0	0	0	0	0	0	0	0
	// bit6  0	0	0	0	0	0	0	0
	// bit7  0	0	0	0	0	0	0	0
	// 而手头的这款点阵屏的驱动方式是行驱动，也就是每次扫描时需要传入一整行的点阵信息
	// 所以需要把每次取到的点阵信息转存到横置竖排（也就是汉字取模软件中的“行列式”）形式的buf中去，
	// 显示时从buf中取连续的一整行的8个字节的数据串行传入595用于扫描显示
	// 而存放的坐标跟这个字所在的显示位置有关系，比如我们打算将上面这个A的点阵显示在屏幕的最左边
	// 那么，转存以后应该是下面这个样子（右侧的数据省略）
	// 也就是说要将取到的B0-B7的最高位组合成buf里的一个字节B0（字符A为例就是0x00）
	// 将取到的B0-B7的次高位组合成buf里的字节B1（字符A为例就是0x10）
	//     bit7 ---------------------- bit0
	// B0	0	0	0	0	0	0	0	0
	// B1	0	0	0	●	0	0	0	0
	// B2	0	0	●	0	●	0	0	0
	// B3	0	0	●	0	●	0	0	0
	// B4	0	0	●	0	●	0	0	0
	// B5	0	●	0	0	0	●	0	0
	// B6	0	●	0	0	0	●	0	0
	// B7	0	●	●	●	●	●	0	0
	// B8	●	0	0	0	0	0	●	0
	// B9	●	0	0	0	0	0	●	0
	// B10	●	0	0	0	0	0	●	0
	// B11	●	0	0	0	0	0	●	0
	// B12	0	0	0	0	0	0	0	0
	// B13	0	0	0	0	0	0	0	0
	// B14	0	0	0	0	0	0	0	0
	// B15	0	0	0	0	0	0	0	0

	uchar bufByteIdx = 0;
	uchar icByteIdx = 0;
	
	uchar* pTmpByteBufHZ;
	
	//clear target data
	//memset(&bufHZ[pos*16], size, 0x00);
	
	switch(size){
		case 32:
			// 汉字
			// 汉字的IC点阵数据16列X16行: 
			// B0-B7 为POS+0区域的上8行数据，B16-B23为POS+0区域的下8行数据
			// B8-B15为POS+1区域的上8行数据，B24-B31为POS+1区域的下8行数据
			// 所以大buff的B0-B7   的数据从IC数据的B0-B7   中取出来（行列互换）
			//     大buff的B8-B15  的数据从IC数据的B16-B23 中取出来（行列互换）
			//     大buff的B16-B23 的数据从IC数据的B8-B15  中取出来（行列互换）
			//     大buff的B24-B31 的数据从IC数据的B24-B31 中取出来（行列互换）
			for (bufByteIdx=0; bufByteIdx<size; bufByteIdx++){
				pTmpByteBufHZ = &(bufHZ[pos*16 + bufByteIdx]);
				//display();//test
				// 先清空目标字节
				pTmpByteBufHZ[0] = 0x00;
				
				if(bufByteIdx < 8){
					for (icByteIdx=0; icByteIdx<8; icByteIdx++){
						// 每次给最低位赋值后左移一位，最后得到8位数据
						pTmpByteBufHZ[0] <<= 1;
						
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							// 如果ic的该位数据是1，则给缓冲字节最低位赋值1
							pTmpByteBufHZ[0] |= 0x01;
						} else {
							// 否则赋值0
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
				
				if(bufByteIdx >= 8 && bufByteIdx < 16 ){
					for (icByteIdx=16; icByteIdx<24; icByteIdx++){
						pTmpByteBufHZ[0] <<= 1;
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							pTmpByteBufHZ[0] |= 0x01;
						} else {
							// 否则赋值0
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
				
				if(bufByteIdx >= 16 && bufByteIdx < 24 ){
					for (icByteIdx=8; icByteIdx<16; icByteIdx++){
						pTmpByteBufHZ[0] <<= 1;
						if (((pICData[icByteIdx]<<(7-bufByteIdx%8)) & 0x80) != 0){
							pTmpByteBufHZ[0] |= 0x01;
						} else {
							// 否则赋值0
							pTmpByteBufHZ[0] &= 0xFE; // 1111 1110
						}
					}
				}
				
